{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"02090c2a-7a49-5ec1-80fa-829e24d92d84","excerpt":"Rest Api w koa.js","frontmatter":{"date":"March 21, 2019","path":"/2019/3/koa-api2","title":"Poradnik Koa #8.2 - własne REST API w Koa.js"}}},{"node":{"id":"7467bec8-efe1-599b-aa65-10b329c73a1e","excerpt":"Podstawowe REST Api Dzisiejszy tytuł jest nieco zwodniczy - co prawda nie będziemy korzystać z KOA, ale nauczymy się jak odpytać Api o dane, co przyda nam się w następnych postach. Czym jest REST Api? REST Api, to w dużym skrócie taki interfejs w…","frontmatter":{"date":"March 10, 2019","path":"/2019/3/koa-api","title":"Poradnik Koa #8.1 - podstawowe REST Api"}}},{"node":{"id":"72688c41-4bb2-54fb-bb44-4c9dcc39bc9d","excerpt":"Koa - pliki statyczne W dzisiejszym tutorialu odkryjemy, jak sprawić aby nasz serwer hostował pliki statyczne takie jak zdjęcia lub pliki kaskadowych arkuszów styli. Za przykład weźmiemy sobie znany nam z poprzednich postów plik  index.pug…","frontmatter":{"date":"February 13, 2019","path":"/2019/2/koa7","title":"Poradnik Koa #7 - pliki statyczne"}}},{"node":{"id":"63e1d99d-4ac1-52fa-9478-eaf7c92b08cf","excerpt":"Podstawowa obsługa formularzy w Koa Ostatnio nauczyliśmy się jak na podstawie danych z serwera tworzyć wygląd naszych podstron, dzisiaj nauczymy się komunikacji w drugą stronę - serwer odbierze dane z naszej witryny! Zacznijmy więc od stworzenia…","frontmatter":{"date":"January 31, 2019","path":"/2019/1/koa6","title":"Poradnik Koa #6 - Formularze"}}},{"node":{"id":"5ead5ae1-ad03-5c1c-b35e-6f2272f8e4c2","excerpt":"Template engines w Koa.js Czym są template engines? Na to pytanie odpowiedziałem dokładniej w tym poście:  Link . W skrócie przypomnę jednak że tak zwane  template engines  to w dużym uproszczeniu często bardzo podobne składnią do  języka html…","frontmatter":{"date":"January 28, 2019","path":"/2019/1/koa5","title":"Poradnik Koa #5 - template engines"}}},{"node":{"id":"dbf835b9-c647-5b72-90a3-8aebfc16209e","excerpt":"Jak stworzyć routing w oddzielnym pliku? Mimo iż stworzenie routingu tak jak zrobiliśmy to w tutorialu nr 2 jest bardzo proste i intuicyjne, warto przenieść routy naszej aplikacji do odzielnego pliku. Jak to zrobić? Zacznijmy od standardowego serwera…","frontmatter":{"date":"January 23, 2019","path":"/2019/1/koa4","title":"Poradnik Koa #4 Routing w oddzielnym pliku"}}},{"node":{"id":"bf815f26-6825-52d2-8973-1faf2b339dea","excerpt":"Template engines w koa.js Co to template engine-y? W pewnym momencie odczujemy potrzebę pobrania pewnych danych na przykład z serwera, a następnie przekazanie go do route naszego serwera w  koa . W jaki sposób możemy to osiągnąć? Sposoby są co…","frontmatter":{"date":"January 22, 2019","path":"/2019/1/koa3","title":"Poradnik Koa #3: Wstęp do template engines"}}},{"node":{"id":"05d780d1-e36c-5b71-967a-2653c54ac8b6","excerpt":"Next w koa(); W poprzednim wpisie stworzyliśmy sobie prosty routing w koa, dzisiaj natomiast w niemal  telegraficznym  skrócie przyjrzymy się metodzie  next()  którą udostępnia nam  koa  oraz jego \"starszy brat\" czyli  Express .  Jak działa next?…","frontmatter":{"date":"January 21, 2019","path":"/2019/1/koanext","title":"Poradnik Koa #2.5: next"}}},{"node":{"id":"53ecb6a2-e914-5bf1-94c6-c37c46f728f8","excerpt":"Routing w Koa Dzisiaj zajmiemy się czymś bardzo ważnym dla praktycznie każdej aplikacji internetowej -  routingiem . Zanim jednak przejdziemy do kodu, musimy ustalić, czym właściwie ten routing jest. Czym jest Routing? Dzięki  routingowi  możemy w…","frontmatter":{"date":"January 20, 2019","path":"/2019/1/koa2","title":"Poradnik Koa #2: routing"}}},{"node":{"id":"56d3350f-9bb2-5e05-92ed-bfeb1cc36485","excerpt":"Witaj w pierwszej części poradnika koa. Zanim przystąpimy do używania frameworka musimy go zainstalować Instalacja potrzebnych pakietów Koa  do działania potrzebuje node.js, natomiast do poprawnej i prostej instalacji frameworka potrzebujemy Node…","frontmatter":{"date":"January 19, 2019","path":"/2019/1/koa1","title":"Poradnik Koa #1: Instalacja i Hello-World"}}},{"node":{"id":"e24a4a00-5e92-55f9-8446-e967cb983f44","excerpt":"Wstęp Obserwując bardzo małą ilość poradników dotyczących używania frameworka Koa, zwłaszcza w języku polskim postanowiłem napisać przewodnik który wytłumaczy podstawy Koa, oraz ułatwi start osobom które nigdy z niego nie korzystały. Czym właściwie…","frontmatter":{"date":"January 18, 2019","path":"/2019/1/koa0","title":"Poradnik Koa #0: Czym jest Koa?"}}}]}},"pageContext":{}}