{"data":{"markdownRemark":{"html":"<h1>Biblioteka webu #3: Czym jest React Native?</h1>\n<p><strong>React Native</strong> to framework pozwalający tworzyć aplikacje mobilne z wykorzystaniem <strong>Javascript</strong> oraz <strong>React</strong>. Jego główną zaletą jest prostota, w szczególności dla frontend developerów. Przeniesienie się na niego z webowej wersji React jest bardzo proste i intuicyjne.</p>\n<h2>Jak zacząć? - instalacja i wymagania wstępne</h2>\n<p>React Native jest szczególnie dobrym wyborem, przy tworzeniu aplikacji mobilnej przez developera znającego <strong>React</strong>, powinna być więc możliwie jak najbardziej zbliżona do tego co znamy z wersji webowej frameworka. Aby rozpocząć, potrzebujemy:\n* Zainstalowany <strong>Android SDK</strong>\n* Android Studio, aby łatwiej zarządzać emulatorami <strong>Android</strong>\n* <strong>React Native CLI</strong></p>\n<h2>React Native CLI</h2>\n<p>React Native CLI to narzędzie pozwalające nam na łątwe tworzenie i zarządzanie projektem <strong>React Native</strong> z posiomu konsoli lub terminala. Zainstalujemy je poprzez <strong>npm</strong>:\n<code class=\"language-text\">npm install -g react-native-cli</code>\nNastępnie aby stworzyć nowy projekt użyj polecenia:\n<code class=\"language-text\">react-native init AwesomeProject</code></p>\n<h2>Pierwszy projekt</h2>\n<p>Aby uruchomić pierwszy projekt, konieczne będzie uruchomienie emulatora Android. W <strong>Android Studio</strong> wejdź w zakładkę <strong>AVD Manager</strong> - ikonka w prawym górnym rogu. Utwórz tam emulator z obrazem <strong>Pie API Level 28 image.</strong> Po przejściu do terminala komenda <code class=\"language-text\">emulator @nazwanaszegoemulatora</code> powinno bezproblemowo odpalić emulator <strong>Android</strong>. Jeżeli nie wiesz jakie nazwy mają emulatory skonfigurowane na twoim komputerze polecenie <code class=\"language-text\">emulator -list-avds</code> wyświetli wszystkie dostępne. Następnie w oddzielnym oknie terminala przechodzimy do katalogu z zainicjowanym wcześniej projektem <strong>AwesomeProject</strong> i uruchamiamy polecenie <code class=\"language-text\">react-native run-android</code>. Na naszym emulatorze powinna uruchomić się podstawowa aplikacja w <strong>React Native</strong>. Więcej na temat instalacji i konfiguracji przeczytasz <a href=\"https://facebook.github.io/react-native/docs/getting-started\">tutaj</a>.</p>\n<h2>Czy warto używać React Native?</h2>\n<p>React Native to naprawdę świetna technologia, zwłaszcza dla developerów piszących obecnie w <strong>React</strong> - mi napisanie prostej aplikacji w <strong>React Native</strong> zajęło niewiele więcej niż analogiczna aplikacja w webowej wersji frameworka. Dodatkowo oszczędzasz czas - framework pozwala na pisanie jednocześnie na <strong>Android</strong> oraz <strong>Ios</strong>. Multiplatformowość oraz prostota nawet kosztem mniejszej wydajności jest w przypadku prostych aplikacji bardzo cenna. Oczywiście nie zawsze <strong>React Native</strong> jest najlepszym wyborem - w przypadku gier, aplikacji bardzo mocno korzystających np z czujników telefonu czy kamery, albo aplikacji potrzebujących naprawdę dużej wydajności framework sprawdzi się gorzej niż na przykład języki natywne, ale do pisania klienta aplikacji webowej na urządzenia mobilne nada się idealnie. Dodatkowym plusem jest możliwość (mimo iż w <strong>React Native</strong> wykorzystuje się komponenty, a nie tagi html) używania części logiki między aplikacją webową w <strong>React</strong> a klientem w <strong>React Native</strong>.</p>\n<h2>Kto używa React Native?</h2>\n<p>Przede wszystkim firma odpowiedzialna za jego rozwój - <strong>Facebook</strong>. Dodatkowo znajdziemy go u takich firm jak:\n* Walmart\n* Instagram\n* Soundcloud</p>\n<p>Mam nadzieję że powyższy post chociaż trochę przybliżył ci czym jest React Native, i dlaczego warto go używać. Dodam również że warto także mieć na oku stworzonę przez <strong>Google</strong> technologie <strong>Flutter</strong> która zdobywa popularność i dla wielu może stanowić przyszłość aplikacji mobilnych. Kto wie, może znajdzie ona swoje miejsce w kolejnych postach?</p>\n<h3>Dzięki za uwagę, Kamil Michna ;)</h3>","frontmatter":{"date":"June 11, 2019","path":"/2019/6/bliblioteka-webdevu-3","title":"Biblioteka Webu #3 - React Native"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}