{"data":{"markdownRemark":{"html":"<h1>Biblioteka Webu #1 - Parcel.js</h1>\n<h2>Tym postem zaczynam nową serię o nazwie Biblioteka Webu. Będę w niej zajmował się krótkim przedstawianiem ciekawych bibliotek oraz technologii związanych z webdevem, zarówno od strony frontendu jak i backendu. Dzisiaj na warsztat zajmiemy się Parcel.js. Do dzieła!</h2>\n<p><img src=\"https://parceljs.org/assets/logo.svg\" alt=\"&#x22;Parcel js logo&#x22;\"></p>\n<p><strong>Parcel</strong> to jak możemy przeczytać na <a href=\"https://parceljs.org/\">jego stronie głównej</a> <strong>Oszałamiająco szybki, niewymagający konfiguracji program tworzący pakiety</strong>. Dlaczego warto go poznać? <strong>Parcel</strong> pozwala nam na:</p>\n<ul>\n<li>Szybkie budowanie naszej aplikacji</li>\n<li>Automatyczne transformacje kodu</li>\n<li>Dzielenie kodu bez żadnej konfiguracji</li>\n<li>Szybki reload aplikacji w przeglądarce</li>\n<li>Wyświetlanie błędów w kodzie w przystępny sposób</li>\n<li>Jest bardzo szybki w porównaniu z podobnymi aplikacjami.</li>\n</ul>\n<h2>Duża część, zwłaszcza osób początkujących ma duży problem z odpowiednią konfiguracją na przykład Webpacka. Parcel rozwiązuje ten problem, jest również świetnym rozwiązaniem do pomniejszych projektów. Jak go użyć?</h2>\n<p>Załóżmy dosyć typowy scenariusz - mamy jedną prostą aplikację webową - żadnych frameworków, jedynie kilka plików Javascript, każdy z osobnym modułem którym musi zająć się nasz <strong>module bundler</strong> oraz kilka plików <strong>.scss</strong> które musimy przetranspilowac na css, no i oczywiście plik <strong>index.html</strong>.</p>\n<p>Struktura katalogu będzie wyglądać z grubsza tak:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">--project\n    index.html\n    --style\n        main.scss\n    --script\n        main.js\n        mainTests.js</code></pre></div>\n<p>Oczywiście struktura jest praktycznie dowolna - mój przykład po prostu będzie odnosił się do dokładnie takiej.</p>\n<p>Na początku przy użyciu <strong>npm</strong> zainstalujmy <strong>Parcela</strong> globalnie: <code class=\"language-text\">npm install -g parcel-bundler</code>. </p>\n<h2>Wszystko przebiegło po naszej myśli? To super! Przejdźmy dalej:</h2>\n<p>Parcel, jak praktycznie każdy module bundler musi mieć podany jakiś plik od którego zacznie budowanie naszej paczki. W przypadku <strong>Parcela</strong> dobrze podać plik <strong>Html</strong> (jak w naszym przypadku) lub na przykład plik <strong>Javscript</strong>. Uzupełnijmy jednak wpierw nasze pliki kodem:</p>\n<div class=\"gatsby-highlight\" data-language=\"html\"><pre class=\"language-html\"><code class=\"language-html\"></code></pre></div>","frontmatter":{"date":"April 23, 2019","path":"/2019/4/bliblioteka-webdevu-1","title":"Biblioteka Webu #1 - Parcel.js"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}