{"data":{"markdownRemark":{"html":"<h1>Jaki system operacyjny wybrać?</h1>\n<p>W zasadzie większość użytkowników można podzielić na 3 obozy: zwolenników <strong>Windowsa</strong>, <strong>Linuksa</strong> oraz <strong>macOS</strong>. Jakie są wady i zalety tych systemów dla programisty? Przyjrzyjmy się im bliżej!</p>\n<h2>Windows</h2>\n<p>Zdecydowanie najpopularniejszy system operacyjny. Jego obsługa jest najłatwiejsza, a integracja z urządzeniami peryferyjnymi bajecznie prosta. Jedną z jego wad jest bardzo mała możliwość modyfikacji, CMD czyli odpowiednik Terminala jest w porównaniu z kuzynem z Linuksa i macOS bardzo... ubogi, a instalacja niektórych narzędzi programistycznych mimo że  bardzo prosta może trwać dłużej niż identyczne operacje na Linuksie - korzystamy najczęściej z graficznych instalatorów, a następnie musimy dodawać daną komendę do <strong>PATH</strong>, natomiast w Linuksie i macOS identyczny rezultat osiągniemy jedną, dwiema komendami.</p>\n<p>Dla kogo jest Windows?:</p>\n<ul>\n<li>\n<p>siemakurwa</p>\n</li>\n<li>\n<p>dla graczy</p>\n</li>\n<li>\n<p>programiści technologii silnie związanych z Microsoft, na przykład C#.</p>\n</li>\n<li>\n<p>osoby korzystające z pakietu Adobe, i niewyobrażające sobie używanie zamiennika.</p>\n</li>\n</ul>\n<p>Oczywiście nie należy zapominać że wszystkie powyższe rzeczy można osiągnąć na innych systemach - jest to jedynie nieco trudniejsze.</p>\n<h2>Linuks</h2>\n<p>Linuks to darmowy system operacyjny. Jego głównymi zaletami są możliwość customizacji, szybkość działania oraz wolność oprogramowania. Mimo wielu mitów na temat tego systemu - używam go na codzień i po przyzwyczajeniu się do niego i odrobinie nauki jest naprawdę o wiele wygodniejszy od <strong>Windowsa</strong></p>\n<p>Dla kogo jest Linuks?:</p>\n<ul>\n<li>Praktycznie większość programistów</li>\n<li>Osoby chcące scustomizować swój system</li>\n<li>Osoby chcące darmowego i wygodnego systemu.</li>\n</ul>\n<p>MacOS </p>\n<p>Wydaje się że jest to połączenie dwóch powyższych systemów. Bardzo szybki i stabilny, łączy bardzo dobry terminal znany z Linuksa z możliwością uruchomienia min pakietu Adobe. Bardzo dobry wybór dla frontendowca, minusem jest jednak cena</p>\n<p>Dla kogo jest macOS?</p>\n<ul>\n<li>graficy</li>\n<li>montażyści</li>\n<li>programiści dla macOS / iOS potrzebujący sprzętu Apple</li>\n<li>Osoby ceniące szybkość działania i jakość </li>\n</ul>\n<p>Mam nadzieję że pomogłem wam podjąć decyzję w wyborze systemu operacyjnego, pamiętajcie jednak że to nie wasz setup ale to co na nim robicie ma znaczenie ;)</p>\n<h3>Dzięki za uwagę!</h3>","frontmatter":{"date":"May 27, 2019","path":"/2019/5/szybka-porada-1","title":"Szybkie Porady #1 - Jaki system operacyjny wybrać?"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}